<details ><summary>apply for talos-bootstrap 2025-07-20 21:32:36 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project vaughnw128/immanent-grove#talos-bootstrap has been locked by PR #79
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_nocloud_image["atuan"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "zst"
      + file_name               = "talos-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "atuan"
      + overwrite               = false
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/84f66f3fa52900a0234636ae1da07d5b356cce774673951af35866142158fce6/v1.10.5/nocloud-amd64.raw.zst"
      + verify                  = true
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["gont"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      ~ id                      = "local:iso/talos-nocloud-amd64.img" -> (known after apply)
      ~ size                    = 1306525696 -> (known after apply)
      ~ url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> "https://factory.talos.dev/image/84f66f3fa52900a0234636ae1da07d5b356cce774673951af35866142158fce6/v1.10.5/nocloud-amd64.raw.zst" # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["controlplane-3"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "103" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.54",
            ],
          - [],
          - [
              - "10.244.3.141",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed5:a6",
            ],
          - [
              - "fe80::74a0:3aff:feeb:b135",
            ],
          - [
              - "fe80::98f6:77ff:fe8b:223d",
            ],
          - [
              - "fe80::788a:9aff:fe80:c731",
            ],
          - [
              - "fe80::a87c:38ff:fee1:6ed7",
            ],
          - [
              - "fe80::38f9:2cff:fea7:3381",
            ],
          - [
              - "fe80::1c7a:3fff:fe0d:8ce1",
            ],
          - [
              - "fe80::5462:f5ff:fee9:a917",
            ],
          - [
              - "fe80::ac52:f3ff:fe01:6fb3",
            ],
          - [
              - "fe80::70fb:bcff:fe0a:3ccc",
            ],
          - [
              - "fe80::8815:8fff:fe49:255a",
            ],
          - [
              - "fe80::30de:4dff:fe8f:bec5",
            ],
          - [
              - "fe80::500a:76ff:feda:b367",
            ],
          - [
              - "fe80::f4cf:fff:feab:d129",
            ],
          - [
              - "fe80::459:a5ff:fed9:5dea",
            ],
          - [
              - "fe80::2033:81ff:fe5f:d056",
            ],
          - [
              - "fe80::8cec:5fff:fe32:3169",
            ],
          - [
              - "fe80::3c3f:ddff:fe36:9247",
            ],
          - [
              - "fe80::94bb:b0ff:fe57:8992",
            ],
          - [
              - "fe80::d0ab:cbff:feb5:b2b3",
            ],
          - [
              - "fe80::5082:26ff:feb5:3112",
            ],
          - [
              - "fe80::dcfb:35ff:fe7e:d473",
            ],
          - [
              - "fe80::8cbc:7ff:fefa:f658",
            ],
          - [
              - "fe80::f01b:7ff:feaa:7e9f",
            ],
          - [
              - "fe80::ecc0:f6ff:fe02:bb4b",
            ],
          - [
              - "fe80::9875:15ff:fee6:8df7",
            ],
          - [
              - "fe80::5401:5ff:fe21:24c5",
            ],
          - [
              - "fe80::380b:cfff:fe7e:2b47",
            ],
          - [
              - "fe80::b8b2:bbff:fe03:936d",
            ],
          - [
              - "fe80::3060:6bff:fe4e:a5f8",
            ],
          - [
              - "fe80::585d:edff:fed0:d6c7",
            ],
          - [
              - "fe80::f01e:abff:fee6:842d",
            ],
          - [
              - "fe80::5897:22ff:fe59:4322",
            ],
          - [
              - "fe80::f8e8:dfff:fe89:e0d6",
            ],
          - [
              - "fe80::6022:dcff:feaa:9a47",
            ],
          - [
              - "fe80::b8d5:26ff:fee2:95a4",
            ],
          - [
              - "fe80::3033:f5ff:fea9:5ad3",
            ],
          - [
              - "fe80::d004:88ff:fe04:5c39",
            ],
          - [
              - "fe80::a8ec:f2ff:fe43:b848",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "42:18:10:6D:90:C7",
          - "9E:BC:CE:57:F1:D6",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D5:00:A6",
          - "76:A0:3A:EB:B1:35",
          - "9A:F6:77:8B:22:3D",
          - "7A:8A:9A:80:C7:31",
          - "AA:7C:38:E1:6E:D7",
          - "3A:F9:2C:A7:33:81",
          - "1E:7A:3F:0D:8C:E1",
          - "56:62:F5:E9:A9:17",
          - "AE:52:F3:01:6F:B3",
          - "72:FB:BC:0A:3C:CC",
          - "8A:15:8F:49:25:5A",
          - "32:DE:4D:8F:BE:C5",
          - "52:0A:76:DA:B3:67",
          - "F6:CF:0F:AB:D1:29",
          - "06:59:A5:D9:5D:EA",
          - "22:33:81:5F:D0:56",
          - "8E:EC:5F:32:31:69",
          - "3E:3F:DD:36:92:47",
          - "96:BB:B0:57:89:92",
          - "D2:AB:CB:B5:B2:B3",
          - "52:82:26:B5:31:12",
          - "DE:FB:35:7E:D4:73",
          - "8E:BC:07:FA:F6:58",
          - "F2:1B:07:AA:7E:9F",
          - "EE:C0:F6:02:BB:4B",
          - "9A:75:15:E6:8D:F7",
          - "56:01:05:21:24:C5",
          - "3A:0B:CF:7E:2B:47",
          - "BA:B2:BB:03:93:6D",
          - "32:60:6B:4E:A5:F8",
          - "5A:5D:ED:D0:D6:C7",
          - "F2:1E:AB:E6:84:2D",
          - "5A:97:22:59:43:22",
          - "FA:E8:DF:89:E0:D6",
          - "62:22:DC:AA:9A:47",
          - "BA:D5:26:E2:95:A4",
          - "32:33:F5:A9:5A:D3",
          - "D2:04:88:04:5C:39",
          - "AA:EC:F2:43:B8:48",
        ] -> (known after apply)
        name                    = "talos-controlplane-3"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxc7133f89cdede",
          - "lxc13244d22e231",
          - "lxc80b1585b8697",
          - "lxc92b41f66e3d1",
          - "lxcdf2186a7f228",
          - "lxc538881d01340",
          - "lxce9669c198748",
          - "lxce8bfb90b64e4",
          - "lxc262e5b087b87",
          - "lxc6b75f9e8c26a",
          - "lxc25cb49699911",
          - "lxcd85e491314b9",
          - "lxc3bc89438f7c5",
          - "lxc648bd86ac1af",
          - "lxcac282464f272",
          - "lxc1cd97d3773f6",
          - "lxc4c0496f55bec",
          - "lxc0e6d43370247",
          - "lxc11434d4f6f38",
          - "lxc9188dfde1725",
          - "lxc5c8c41e00ce0",
          - "lxc5c4391fcf4c1",
          - "lxcab84616fa254",
          - "lxc912c1f8d5ed1",
          - "lxce966840665c9",
          - "lxcdf9f8e22e77e",
          - "lxc90815683d517",
          - "lxca81b8cf224ec",
          - "lxc9d4210794b72",
          - "lxcdd23e0514d61",
          - "lxc71f46d553cd1",
          - "lxcb25732e6c8c9",
          - "lxcc07731c13869",
          - "lxc263e17a3ea3b",
        ] -> (known after apply)
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 103 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-103-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

          ~ ip_config {
              ~ ipv4 {
                  ~ address = "10.0.0.54/24" -> "10.0.0.52/24"
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:D5:00:A6" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["worker-1"] will be created
  + resource "proxmox_virtual_environment_vm" "talos_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "talos-worker-1"
      + network_interface_names = (known after apply)
      + node_name               = "atuan"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "talos",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 12
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v2-AES"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + file_id           = (known after apply)
          + interface         = "virtio0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 100
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.0.0.53/24"
                  + gateway = "10.0.0.1"
                }
            }
        }

      + memory {
          + dedicated      = 32768
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # talos_machine_configuration_apply.config_apply["controlplane-3"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "config_apply" {
      ~ endpoint                    = "10.0.0.54" -> "10.0.0.52"
        id                          = "machine_configuration_apply"
      ~ node                        = "10.0.0.54" -> "10.0.0.52"
        # (5 unchanged attributes hidden)
    }

  # talos_machine_configuration_apply.config_apply["worker-1"] will be created
  + resource "talos_machine_configuration_apply" "config_apply" {
      + apply_mode                  = "auto"
      + client_configuration        = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJobS9hdmRoWXd4b2Mrc0h1NmIzaktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXhNamt3TlRNek1UTmFGdzB5TmpBeE1qa3dOVE16TVROYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQWl2ZVNNM3l3ZFhrVWlLQkVBL3ZDYlBSeUJ4U3M2aXVsCjd5UVJEK2hQUlNpalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCVFQ3YlM0eUw4QnZ1eVBnNFVKM3g3V2l0RHdCakFGQmdNclpYQURRUUJYWXRmMApSWlVWYXFQSVplcWJiVnJpT1ZVaXI0Vm5QS3BVVTZNcnJEL0pmMlVKQ0dUOVBJaEpXZ3poNmtUekg0TmdGZUU0CmRFa2RtMis1SCtrVXE1Z0cKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + client_key         = (sensitive value)
        }
      + config_patches              = [
          + <<-EOT
                "cluster":
                  "allowSchedulingOnControlPlanes": true
                  "discovery":
                    "enabled": true
                  "network":
                    "cni":
                      "name": "none"
                  "proxy":
                    "disabled": true
            EOT,
        ]
      + endpoint                    = "10.0.0.53"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.0.53"
    }

Plan: 5 to add, 1 to change, 2 to destroy.
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Destroying... [id=103]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Still destroying... [id=103, 10s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Still destroying... [id=103, 20s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Still destroying... [id=103, 30s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Still destroying... [id=103, 40s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Still destroying... [id=103, 50s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Still destroying... [id=103, 1m0s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Still destroying... [id=103, 1m10s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Still destroying... [id=103, 1m20s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Still destroying... [id=103, 1m30s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Still destroying... [id=103, 1m40s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Still destroying... [id=103, 1m50s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Still destroying... [id=103, 2m0s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Destruction complete after 2m5s
proxmox_virtual_environment_download_file.talos_nocloud_image["gont"]: Destroying... [id=local:iso/talos-nocloud-amd64.img]
proxmox_virtual_environment_download_file.talos_nocloud_image["atuan"]: Creating...
proxmox_virtual_environment_download_file.talos_nocloud_image["gont"]: Destruction complete after 0s
proxmox_virtual_environment_download_file.talos_nocloud_image["gont"]: Creating...
proxmox_virtual_environment_download_file.talos_nocloud_image["atuan"]: Still creating... [10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["gont"]: Still creating... [10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["gont"]: Creation complete after 15s [id=local:iso/talos-nocloud-amd64.img]
proxmox_virtual_environment_download_file.talos_nocloud_image["atuan"]: Creation complete after 15s [id=local:iso/talos-nocloud-amd64.img]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Creating...
proxmox_virtual_environment_vm.talos_vm["worker-1"]: Creating...
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Still creating... [10s elapsed]
proxmox_virtual_environment_vm.talos_vm["worker-1"]: Still creating... [10s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-3"]: Creation complete after 18s [id=103]
proxmox_virtual_environment_vm.talos_vm["worker-1"]: Still creating... [20s elapsed]
proxmox_virtual_environment_vm.talos_vm["worker-1"]: Creation complete after 28s [id=102]
talos_machine_configuration_apply.config_apply["worker-1"]: Creating...
talos_machine_configuration_apply.config_apply["controlplane-3"]: Modifying... [id=machine_configuration_apply]
talos_machine_configuration_apply.config_apply["controlplane-3"]: Modifications complete after 0s [id=machine_configuration_apply]
talos_machine_configuration_apply.config_apply["worker-1"]: Creation complete after 8s [id=machine_configuration_apply]

Apply complete! Resources: 5 added, 1 changed, 2 destroyed.

Outputs:

kubeconfig = <sensitive>

```
</details>

</details>